Tekla.Structures.Model.Polymesh
The Polygon class represents a polygon object that has its corners at the given points.
The Polygon class represents a polygon object that has its corners at the given points.

Tekla.Structures.Model.Polymesh.Brep
Gets or sets the polymesh that forms the object geometry.

Tekla.Structures.Model.Polymesh.ConvertToStruct(Tekla.Structures.Geometry3d.FacetedBrep,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Converts a FacetedBrep to struct dot polymesh.
brep: The input brep polymesh
output: The output dot polymesh
Returns: The converted polymesh instances

Tekla.Structures.Model.Polymesh.Fingerprint(Tekla.Structures.Geometry3d.FacetedBrep)
Gets fingerprint information for input brep
brep: The input parameter
Returns: Fingerprint of the brep in string format

Tekla.Structures.Model.Polymesh.CompareFingerprints(System.String,System.String)
Compares two fingerprints
fingerprint1: The input parameter
fingerprint2: The input parameter2
Returns: True if fingerprints match, false otherwise

Tekla.Structures.Model.Polymesh.Convert(Tekla.Structures.ModelInternal.dotPolymesh_t@)
Converts a struct of polymeshes to a list of FacetedBrep.
input: The input parameter
Returns: The converted polymesh instances

Tekla.Structures.Model.Polymesh.ToStruct(Tekla.Structures.ModelInternal.dotPolymesh_t@)
Converts a FacetedBrep to dotnet polymesh struct.
output:
The output parameter.

Tekla.Structures.Model.Polymesh.FromStruct(Tekla.Structures.ModelInternal.dotPolymesh_t@)
Converts a struct of polymesh to a FacetedBrep.
input: The input parameter

Tekla.Structures.Model.Polymesh.Validate(Tekla.Structures.Geometry3d.FacetedBrep,Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags,System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Int32,Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum}}@)
Converts a FacetedBrep to a polymesh and validates.
brep: The FacetedBrep to be converted and validated
checkCriteria: The flags to indicate what to check
invalidInfo: The problematic faces' indices and their failed reasons,
(-1, PolymeshUndefined) is for unknown reason for uncertain face.
No inner loops checked further if outer loop found error.
Returns: True if valid, false if error found

Tekla.Structures.Model.Polymesh.GetSolidBrep(Tekla.Structures.Geometry3d.FacetedBrep,Tekla.Structures.Geometry3d.FacetedBrep@)
Gets the cleaned Brep
inBrep: FacetedBrep to be cleaned
outBrep: Cleaned facetedBrep
Returns: True if Brep can create a valid solid, false if outBrep is nonsolid

Tekla.Structures.Model.Polymesh.ConvertInvalidInfoFromStruct(Tekla.Structures.ModelInternal.dotPolymeshValidateInvalidInfo_t@)
Convert a struct of invalid info to a list of pairs of outer loop index and error code.
Read indexes and error codes from the integer list.
input: Invalid info passed from TS core
Returns: A list of pairs of outer loop index, error code